var backgrounddata = {
   "compendium": {
      "background": [
         {
            "name": "Acolyte",
            "source": "Player's Handbook",
            "proficiency": "Insight, Religion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Religion"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A holy symbol (a gift to you when you entered the priesthood), a prayer book or prayer wheel, 5 sticks of incense, vestments, a set of common clothes, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: Shelter of the Faithful",
                  "text": [
                     "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.",
                     null,
                     "You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Acolytes are shaped by their experience in temples or other religious communities. Their study of the history and tenets of their faith and their relationships to temples, shrines, or hierarchies affect their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme."
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "",
                     "d8 - Trait",
                     "1 - I idolize a particular hero of my faith, and constantly refer to that person’s deeds and example.",
                     "2 - I can find common ground between the fiercest enemies, empathizing with them and always working toward peace.",
                     "3 - I see omens in every event and action. The gods try to speak to us, we just need to listen.",
                     "4 - Nothing can shake my optimistic attitude.",
                     "5 - I quote (or misquote) sacred texts and proverbs in almost every situation.",
                     "6 - I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods.",
                     "7 - I’ve enjoyed fine food, drink, and high society among my temple’s elite. Rough living grates on me.",
                     "8 - I’ve spent so long in the temple that I have little practical experience dealing with people in the outside world."
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "",
                     "d6 - Ideal",
                     "1 - Tradition. The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful)",
                     "2 - Charity. I always try to help those in need, no matter what the personal cost. (Good)",
                     "3 - Change. We must help bring about the changes the gods are constantly working in the world. (Chaotic)",
                     "4 - Power. I hope to one day rise to the top of my faith’s religious hierarchy. (Lawful)",
                     "5 - Faith. I trust that my deity will guide my actions. I have faith that if I work hard, things will go well. (Lawful)",
                     "6 - Aspiration. I seek to prove myself worthy of my god’s favor by matching my actions against his or her teachings. (Any)"
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "",
                     "d6 - Bond",
                     "1 - I would die to recover an ancient relic of my faith that was lost long ago.",
                     "2 - I will someday get revenge on the corrupt temple hierarchy who branded me a heretic.",
                     "3 - I owe my life to the priest who took me in when my parents died.",
                     "4 - Everything I do is for the common people.",
                     "5 - I will do anything to protect the temple where I served.",
                     "6 - I seek to preserve a sacred text that my enemies consider heretical and seek to destroy."
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "",
                     "1 - I judge others harshly, and myself even more severely.",
                     "2 - I put too much trust in those who wield power within my temple’s hierarchy.",
                     "3 - My piety sometimes leads me to blindly trust those that profess faith in my god.",
                     "4 - I am inflexible in my thinking.",
                     "5 - I am suspicious of strangers and expect the worst of them.",
                     "6 - Once I pick a goal, I become obsessed with it to the detriment of everything else in my life."
                   ]
               }
            ]
         },
		 {
            "name": "Anthropologist",
            "source": "Tomb of Annihilation",
            "proficiency": "Insight, Religion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Religion",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A leather-bound diary, a bottle of ink, an ink pen, a set of traveler's clothes, one trinket of special significance, and a pouch containing 10 gp ",
                  ]
               },
			   {
                  "name": "Cultural Chameleon",
                  "text": [
                     "Before becoming an adventurer, you spent much of your adult life away from your homeland, living among people different from your kin. You came to understand these foreign cultures and the ways of their people, who eventually treated you as one of their own. One culture had more of an influence on you than any other, shaping your beliefs and customs. Choose a race whose culture you've adopted, or roll on the Adopted Culture table. ",
					 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:200px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Culture</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Aarakocra</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Dwarf</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Elf</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Goblin</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>Halfling</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Human</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>Lizardfolk</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>Orc</td>",
						"</tr>",
					"</table>",
                  ]
               },
               {
                  "name": "Feature: <i>Adept Linguist</i>",
                  "text": [
                     "You can communicate with humanoids who don't speak any language you know. You must observe the humanoids interacting with one another for at least 1 day, after which you learn a handful of important words, expressions, and gestures - enough to communicate on a rudimentary level. ",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Anthropologists leave behind the societies into which they were born to discover what life is like in other parts of the world. They seek to see how other races and civilizations survive - or why they did not. Some anthropologists are driven by intellectual curiosity, while others want the fame and recognition that comes with being the first to discover a new people, a lost tribe, or the truth about an ancient empire's downfall. ",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I prefer the company of those who aren't like me, including people of other races. </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I'm a stickler when it comes to observing proper etiquette and local customs.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I would rather observe than meddle. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>By living among violent people, I have become desensitized to violence. </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I would risk life and limb to discover a new culture or unravel the secrets of a dead one. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>When I arrive at a new settlement for the first time, I must learn all its customs. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Discovery</b>. I want to be the first person to discover a lost culture. (Any) </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Distance</b>. One must not interfere with the affairs of another culture - even one in need of aid. (Lawful) </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Knowledge</b>. By understanding other races and cultures, we learn to understand ourselves. (Any) </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Power</b>. Common people crave strong leadership, and I do my utmost to provide it. (lawful) </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Protection</b>. I must do everything possible to save a society facing extinction. (Good) </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Indifferent</b>. Life is cruel. What's the point in saving people if they're going to die anyway? (Chaotic) </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>My mentor gave me a journal filled with lore and wisdom. Losing it would devastate me. </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Having lived among the people of a primeval tribe or clan, I long to return and see how they are faring. </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Years ago, tragedy struck the members of an isolated society I befriended, and I will honor them. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I want to learn more about a particular humanoid culture that fascinates me. </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I seek to avenge a clan, tribe, kingdom, or empire that was wiped out. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I have a trinket that I believe is the key to finding a long-lost society. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Boats make me seasick. </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I talk to myself, and I don't make friends easily. </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I believe that I'm intellectually superior to people from other cultures and have much to teach them. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I've picked up some unpleasant habits living among goblins, lizardfolk, or orcs. </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I complain about everything. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I wear a tribal mask and never take it off. </td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
		 {
            "name": "Archaeologist",
            "source": "Tomb of Annihilation",
            "proficiency": "History, Survival",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Survival",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Cartographer's tools, or navigator's tools",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A wooden case containing a map to a ruin or dungeon, a bullseye lantern, a miner's pick, a set of traveler's clothes, a shovel, a two-person tent, a trinket recovered from a dig site, and a pouch containing 25 gp ",
                  ]
               },
			   {
                  "name": "Dust Digger",
                  "text": [
                     "Prior to becoming an adventurer, you spent most of your young life crawling around in the dust, pilfering relics of questionable value from crypts and ruins. Though you managed to sell a few of your discoveries and earn enough coin to buy proper adventuring gear, you have held onto an item that has great emotional value to you. Roll on the Signature Item table to see what you have, or choose an item from the table. ",
					 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:200px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Item</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>10-foot pole</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Crowbar</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Hat</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Hooded lantern</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>Medallion</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Shovel</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>Sledgehammer</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>Whip</td>",
						"</tr>",
					"</table>",
                  ]
               },
               {
                  "name": "Feature: <i>Historical Knowledge</i>",
                  "text": [
                     "When you enter a ruin or dungeon, you can correctly ascertain its original purpose and determine its builders, whether those were dwarves, elves, humans, yuan-ti, or some other known race. In addition, you can determine the monetary value of art objects more than a century old. ",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Few archaeologists can resist the lure of an unexplored ruin or dungeon, particularly if such a site is the source of legends or is rumored to contain the treasures and relics of wizards, warlords, or royalty. Some archaeologists plunder for wealth or fame, while others consider it their calling to illuminate the past or keep the world's greatest treasures from falling into the wrong hands. Whatever their motivations, archaeologists combine the qualities of a scrappy historian with the self-made heroism of a treasure-hunting scoundrel. ",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I love a good puzzle or mystery.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I'm a pack rat who never throws anything away.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Fame is more important to me than money.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I have no qualms about stealing from the dead.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I'm happier In a dusty old tomb than I am in the centers of civilization.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Traps don't make me nervous. idiots who trigger traps make me nervous.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I might fail, but I will never give up.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>You might think I'm a scholar, but I love a good brawl. These fists were made for punching. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Preservation</b>. That artifact belongs in a museum. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Greed</b>. I won't risk my life for nothing. I expect some kind of payment. (Any)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Death Wish</b>. Nothing is more exhilarating than a narrow escape from the jaws of death. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Dignity</b>. The dead and their belongings deserve to be treated with respect. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Immortality</b>. All my exploring is part of a plan to find the secret of everlasting life. (Any) </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Danger</b>. With every great discovery comes grave danger. The two walk hand in hand. (Any) </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Ever since I was a child, I've heard stories about a lost city. I aim to find it, learn its secrets, and earn my place In the history books. </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I want to find my mentor, who disappeared on an expedition some time ago. </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I have a friendly rival. Only one of us can be the best, and I aim to prove it's me. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I won't sell an art object or other treasure that has historical significance or is one of a kind. </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I'm secretly in love with the wealthy patron who sponsors my archaeological exploits. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I hope to bring prestige to a library, a museum, or a university. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I have a secret fear of some common wild animal - and in my work, I see them everywhere. </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I can't leave a room without searching it for secret doors. </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>When I'm not exploring dungeons or ruins, I get jittery and impatient. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I have no time for friends or family. I spend every waking moment thinking about and preparing for my next expedition. </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>When given the choice of going left or right, I always go left. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I can't sleep except in total darkness. </td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
		 {
            "name": "Barkeep",
            "source": "PMS Squad",
            "proficiency": "",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Persuasion",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set, brewer’s supplies",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "Common clothes, brewer’s supplies, and a belt pouch containing 15 gp",
                  ]
               },
               {
                  "name": "Feature: <i>Cheers!</i>",
                  "text": [
                     "You have no trouble finding and getting into places that serve drinks. While drinking in a social establishment, strangers take a liking towards you and feel comfortable enough to share gossip.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Barkeeps can be anything from jovial to downright rude. Regardless, all barkeeps know how to take care of business. They break up fights, they kick out drunk patrons, and they give honest advice to people down on their luck. Barkeeps encounter all different types of travelers, and have heard a lot of amazing tales. That said, the stagnant profession of a barkeep means that most stories you hear from them will be ones they never experienced themselves.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I’m always looking for a good time with good company.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I always try to give people advice.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I’m constantly surrounded by a social atmosphere, yet I always feel alone.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I live vicariously through the people I meet and the stories I hear.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m everyone’s outlet but sometimes I just want to punch everyone in their stupid faces.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>If you’re looking for a fight, I’ll give you one.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I know how to calm people down just as much as I know how to rile them up.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>It’s not all fun and games. I’m trying to run a business here.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Positivity</b>. Spreading joy is my passion. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Guidance</b>. It’s our duty to help others. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Legacy</b>. We only have one chance to write our story. Do what you want and make it count. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Manipulate</b>. Drunk people are the most vulnerable and can easily be taken advantage of. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>People</b>. I like meeting and connecting with new people. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Honesty</b>. If I call you an asshole, it means I like you. (Any)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>My tavern means everything to me. It brings back Important memories from my past.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Brewing is my craft. My art brings people together.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>The regular patrons of my tavern are family to me.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I’ve met so many people while staying in the same place. I need my own adventure.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I want to be successful. Whatever it takes.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Alcohol is all I need.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I can always go for another round. The toilet is my second home.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I judge people that don’t drink.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Party animals and depressed people make me feel bitter about my life.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Whenever life gets hard, I drink my problems away.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I need to know everyone’s story.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I curse more than a fucking sailor.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
		 {
            "name": "Beauty",
            "source": "PMS Squad",
            "proficiency": "",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Persuasion, Performance",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of fine clothes, a hand mirror, a token of affection from an admirer, either a makeup palette or a shaving kit, a purse of 15 gp",
                  ]
               },
			   {
                  "name": "Supernaturally Stunning",
                  "text": [
                     "You are not a usual handsome man or pretty girl that one might find anywhere. There is something transcendent, even unnatural, about your appearance, as if you were designed with mathematical precision to draw admiration. Some may suspect that magic is behind it, and they may be right. Choose from the table below or roll on the table to determine the cause of your beauty. Some options have additional implications. Discuss with your DM to determine what these are and how they will play into the campaign.",
					 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Cause of Beauty</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I was given a divine blessing, either as a reward or as a tool to help me complete a quest.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I or my parents made a deal with a demon or another mysterious dark force.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>A genie granted my wish or my parents’ wish for me to be beautiful—but, there was a twist.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>My appearance was altered by a powerful spellcaster.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I am of average beauty naturally, but I have exceptional talent with makeup.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Good genetics and dumb luck.</td>",
						"</tr>",
					"</table>",
                  ]
               },
               {
                  "name": "Feature: <i>Enchanting Features</i>",
                  "text": [
                     "Your appearance means that people who aren’t already aggressive or hostile towards you may treat you differently. They will be more willing to interact with you or give you special treatment, especially if they are inclined to be attracted to your gender.",
					 "However, your interactions are more likely to be misinterpreted as flirtatious. Those who are helping you may attempt to make romantic moves on you, and will be upset if you reject them. They may even become angry if they believe you were leading them on intentionally. Those who see your beauty as a threat, such as someone who likes or is married to a person you are “flirting” with, may treat you with hostility.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "With everyone else so focused on your exterior, it’s hard for you not to be obsessed with your own looks yourself. Whether your revel in your own beauty or you are annoyed at the way others treat you, your appearance is at the forefront of your mind and shapes many of your personality traits.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I go to great lengths to disguise myself to stay unnoticed.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>With the impractical outfits I wear into battle, it’s a wonder I’m still alive.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I jump at the chance to give anyone a makeover.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>There’s no shame in using my charm to get my way.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m worried my looks intimidate people. I don’t think I’m better than you, I swear!</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I strike a pose at any opportunity, even in the midst of battle. I don’t realize I do this.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I am stubbornly oblivious about my own attractiveness.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I can’t stand grime, so I clean myself obsessively.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Beauty</b>. I want to be the embodiment of all that is beautiful. (Any)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Fun</b>. I want to see how much my looks will let me get away with. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Control</b>. I gleefully manipulate others to get my way. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Inspiration</b>. I want my presence to uplift those around me. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Expectation. I will be exactly what society wants and needs me to be, in fashion and behavior. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Aspiration</b>. I want to be as beautiful on the inside as I am on the outside. (Good)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I am a close consort to a monarch or noble and I will do whatever I can to honor them.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I am a representative of an organization hired to advertise them across the world.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>No one takes me seriously as an adventurer because I’m so “high-maintenance.” I will prove them wrong.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>An evil person took advantage of me when I was young and naive, and I want revenge.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I seek immortality so that I may stay young and beautiful forever.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>My wealthy family only saved me from poverty because of my beauty, but I still owe them my life.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>My looks are superior, so I must be superior in every other way.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Sometimes, my fear of soiling my beauty keeps me from taking risks and doing dirty work.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I always expect other people to do things for me.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I have been used in traumatizing ways too many times for trust to come easily.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I waste my money on luxuries and pampering.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I could stare at myself in the mirror all day.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Charlatan",
            "source": "Player's Handbook",
            "proficiency": "Deception, Sleight of Hand",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Deception, Sleight of Hand"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Disguise Kit, Forgery Kit"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of fine clothes, a disguise kit, tools of the con of your choice (ten stoppered bottles filled with colored liquid, a set of weighted dice, a deck of marked cards, or a signet ring of an imaginary duke), and a belt pouch containing 15 gp."
                  ]
               },
               {
                  "name": "Feature: False Identity",
                  "text": [
                     "You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona. Additionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."
                  ]
               }
            ]
         },
         {
            "name": "City Watch",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Athletics, Insight",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Insight"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A uniform in the style of your unit and indicative of your rank, a horn with which to summon help, a set of manacles, and a pouch containing 10 gp."
                  ]
               },
               {
                  "name": "Feature: Watcher's Eye",
                  "text": [
                     "Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you're more likely to be welcome in the former locations rather than the latter."
                  ]
               }
            ]
         },
         {
            "name": "Clan Crafter",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "History, Insight",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Insight"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of artisan's tools"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Dwarvish or one of your choice if you already speak Dwarvish"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of artisan's tools with which you are proficient, a maker's mark chisel used to mark your handiwork with the symbol of the clan of crafters you learned your skill from, a set of traveler's clothes, and a pouch containing 5 gp and a gem worth 10 gp."
                  ]
               },
               {
                  "name": "Feature: Respect of the Stout Folk",
                  "text": [
                     "As well respected as clan crafters are among outsiders, no one esteems them quite so highly as dwarves do. You always have free room and board in any place where shield dwarves or gold dwarves dwell, and the individuals in such a settlement might vie among themselves to determine who can offer you (and possibly your companions) the finest accomodations and assistance."
                  ]
               }
            ]
         },
         {
            "name": "Cloistered Scholar",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "History",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, plus your choice of one from among Arcana, Nature, and Religion"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Languages: any two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "The scholar's robes of your cloister, a writing kit (small pouch with a quill, ink, folded parchment, and a small penknife), a borrowed book on the subject of your current study, and a pouch containing 10 gp."
                  ]
               },
               {
                  "name": "Feature: Library Access",
                  "text": [
                     "Though others must often endure extensive interviews and significant fees to gain access to even the most common archives in your library, you have free and easy access to the majority of the library,, though it might also have repositories of lore that are too valuable, magical, or secret to permit anyone immediate access.",
                     "You have a working knowledge of your cloister's personnel and bureaucracy, and you know how to navigate those connections with some ease.",
                     "Additionally, you are likely to gain preferential treatment at other libraries across the Realms, as professional courtesy to a fellow scholar."
                  ]
               }
            ]
         },
         {
            "name": "Courtier",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Insight, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Persuasion"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of fine clothes and a pouch containing 5 gp."
                  ]
               },
               {
                  "name": "Feature: Court Functionary",
                  "text": [
                     "Your knowledge of how bureaucracies function lets you gain access to the records and inner workings of any noble court or government you encounter. You know who the movers and shakers are, whom to go to for the favors you seek, and what the current intrigues of interest in the group are."
                  ]
               }
            ]
         },
         {
           "name": "Criminal",
           "source": "Player's Handbook",
            "proficiency": "Deception, Stealth",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Deception, Stealth"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set, thieves' tools"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: Criminal Contact",
                  "text": [
                     "You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
                  ]
               }
            ]
         },
		 {
            "name": "Dead",
            "source": "Xanathar's Lost Notes to Everything Else",
            "proficiency": "History, Intimidation",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Intimidation",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     " 50 feet of rope, a bit of dirt from your grave in a sacred vial, a set of common clothes, two rare coins with which you were buried, and a belt pouch with 5 gp",
                  ]
               },
               {
                  "name": "Feature: <i>Spirit Talk</i>",
                  "text": [
                     "You can connect with the souls of the dead thanks to the long time you spent dead. You may spend a day of downtime communicating with the souls to learn a piece of information by asking a question. The quality and specifics of the information you get is up to the DM.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "You have experienced something few living people have yet to go through. You might be the type who embraces the second chance and loves life, relishing every opportunity and letting nothing stand in your way. Or you might be quiet and brooding, thinking of the revenge you seek for your death or missing the planar heaven you left behind. People who have died often live in one of these extremes, experiencing life to the fullest or becoming fixated on a single goal that gives their new life meaning.",
                   ]
               },
               {
                  "name": "Personality Traits",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					"</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality traits</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>When faced with a new experience the word \"no\" isn't in my vocabulary.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I always have the loudest laugh in the room.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>When I want something, I'm direct and simple in my request.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>The story of my demise, like all my stories, is greatly exaggerated.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>Those who ask me about my death quickly learn to never ask again.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I treat most people like they're idiots. They don't know what I know</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>If I don't want to do something, I simply don't do it.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I don't excite easily</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					"</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideals</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Freedom</b>. Life is short so live how you want. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Despair</b>. Nothing in life is worth celebrating and death is the destination we all deserve. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Vengeance</b>. I will find and punish what killed me. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Charity</b>. I want to prevent others from dying before their time. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Mercy</b>. I was given a second chance and others should get the same opportunity. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Labor</b>. Life is short, and so I must keep working to make my mark. (Lawful)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					"</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bonds</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I have a great fear of that which killed me.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>The scars of my death wound are still on my body</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>My vengeance is more important than any other task.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I never wish to return to my gravesite.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I wish to bring back another who died by my side.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Any mention of my hometown reminds me of my first life. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					"</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaws</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Death isn't a big deal to me. I've died and come back. People should stop whining.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I don't listen to protests before I do something reckless.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I'd rather be mad than solve a problem making me angry.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I would rather cheat, lie, and steal than be honest because none of this matters.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>Everything was better when I was dead.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I believe that I am better than everyone who hasn't died and come back from the dead.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Entertainer",
            "source": "Player's Handbook",
            "proficiency": "Acrobatics, Performance",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Acrobatics, Performance"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Disguise kit, one type of musical instrument"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A musical instrument (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), a costume, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: By Popular Demand",
                  "text": [
                     "You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or even in a noble's court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you."
                  ]
               }
            ]
         },
		 {
            "name": "Ex-Cultist",
            "source": "Warlock Homebrew",
            "proficiency": "",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Deception, Religion",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Poisoner’s Kit",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "Tattered robes, symbol of your dark lord, blasphemous holy text, curved ritual dagger, poisoner’s kit, and small pouch containing gp.",
                  ]
               },
			   {
                  "name": "Change of Heart",
                  "text": [
                     "Why did you walk away from the world you knew, and why did you seek something different? Was this choice you made, or did fate separate you from your fellow devotees? Do you wish to undo the evil that your cult perpetuated, or would you rejoin your cult if given the chance? Work with your DM to decide What you and your cult worshipped, how much of your cult still exists. You may also need to work out why you left the cult, or you can roll on the following table.",
					 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Change of Heart</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I witnessed particularly gruesome rite and ran for my life.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>A botched ritual slaughtered the other members of my circle. Only survived.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I asked the wrong kind of questions. The others planned to sacrifice me to our dark lord, but I escaped.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Adventurers hunted us down, and only I was able to escape.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>The other cultists disappeared through a portal to a land of unspeakable horrors. Terrified, I stayed behind.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>The others took their own lives to ascend. I could not.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I no longer believed in what we were doing. It seemed wrong, somehow.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>A friend or family member rescued me, taking me away by force.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Feature: <i>Secret Signs</i>",
                  "text": [
                     "You know the secret symbology of your cult, which can pop up in some surprising places. Some nobles, influential persons, or even common townsfolk may also be members of your cult, and with a subtle gesture or knowing handshake you can discern who still follows the ways of your dark lord.",
					 "Cloisters of your cult may also be hidden across the land, identified by the secret signs and symbols designed to lead the faithful to places of dark worship. Such Cloisters often contain enough lodging and food for at least ten people, for a week, and sometimes harbor eldritch treasures belonging to the cult. Cloisters with treasure still intact likely contain practicing cultists or guardian monsters, however; your cult was not foolish enough to let its secrets remain unguarded.",
                  ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Everything is a sign of coming doom. Every. Single. Thing.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>The world outside is so exciting! Now I can do everything the dark lord used to forbid, like drinking wine, or wearing shoes!</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>The dark lord used to order us to do everything. It’s a little hard for me to live without that. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>If my friends will let me, I’ll openly reminisce about my old days in the cult all daylong.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I still can’t help but check the holy scriptures for advice about any given situation.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>It’s no big deal, it’s not the end ofthe world. That’s not for another five years, three months, ten days, twelve hours...</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>It’s still important to leave the old offerings, to perform the old rites.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I’ll happily inform those I meet of the many ways in which they are being heretical.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Loyalty</b> My new companions are my new family, I will protect them. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Reparation</b> I must fix the evils my cult has done. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Independence</b>. I’ll never be bound in servitude again! (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Power</b>. The dark lord was weak in the end. I will be stronger than they ever were. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Secrets</b>. The lore of my cult is historically important, I and should preserve it. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Revision</b>. The cult failed because the holy book was wrong. I must learn about the outside world, and fix the book’s errors. (Neutral)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I must discover the truth behind my dark lord, even if it kills me.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I need to reconnect with the people from my life before the cult, if I can ever find them.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I must free other minions from unwitting service to dark masters.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>A monstrous, immortal guardian of the cult is hunting me. I pray it never finds me.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I sold my soul in service to the dark lord, and now I seek to reclaim it.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>The day of reckoning is coming, and my knowledge is the key to stopping it. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>If I ever had the chance, I’d definitely rejoin my cult.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I'm a little too into blood sacrifice. </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Knowledge is more important than sanity.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I’m often more interested in than frightened of abominable eldritch monsters.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m almost too willing to follow orders without thinking. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Murder was significantly less frowned upon by the cult than in the outside world.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
		 {
            "name": "Exile",
            "source": "PMS Squad",
            "proficiency": "",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Survival",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Navigator’s tools, one type of artisan’s tools",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A memento from your former life (family crest, official order of rejection, or other keepsake), a walking stick (quarterstaff), a compass, a winter blanket, a set of traveler’s clothes, and a small pouch containing 5 gp",
                  ]
               },
			   {
                  "name": "Exile Type",
                  "text": [
                     "There are many different kinds of exiles, implying different reasons for being cast out. You can roll on the following table to determine your exile type, or choose one that best fits your character.",
					 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:200px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Type</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Lawbreaker</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Dissident</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Deviant</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Refugee</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>Heretic</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Oddball</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Feature: <i>Outsider's Perspective</i>",
                  "text": [
                     "As an outsider, you see society in a different way than most, and can more critically evaluate it from a distance. As you spend time in a city, town, or tribe, the flaws and advantages of the system rapidly become evident to you, and you pick up quickly on social dynamics. By interacting with locals and moving about the area you are able to determine things like the current balance of power, pressing issues and news, if there is unhappiness with the current status quo, and who important figures might be. However as an outsider, others are less likely to welcome your criticism of their society without good reason.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Some exiles take time to adjust to their new life, clinging to the past, while others adapt quickly and try to sever any ties to home. They may be slow to trust or eager to make allies and find a new home. Some seek only to return.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I frequently talk to other travelers seeking news about my former home.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I avoid the topic of my former home as much as possible.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I am slow to trust others and keep to myself.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I prefer to sit and/or sleep with my back to a solid surface.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m extremely loyal to the friends I make.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Everything I say sounds sarcastic or cynical.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I still follow the culture and practices of my former home.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I feel a need to prove myself, to show I can help and should be kept around.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Revenge</b>. They will rue the day they cast me out. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Belonging</b>. Everyone has a place in the world, I just have to find mine. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Independence</b>. I will not abide by bad rules or traditions. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Tradition</b>. I am not above the law, what happened was just. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Redemption</b>. I will make the best of my exile in an attempt to help others. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Destiny</b>. Nothing will distract me from my higher calling. (Any)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>My family, clan, or heritage is the most important thing to me, despite the distance.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I may be exiled, but my former home is still home.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Those responsible for my situtation need to pay for what they’ve done.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I still have a few contacts from my old home that I can communicate with.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>The past is behind me, I will work towards a better future for myself.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I am still being hunted, and will not be free until my pursuers are dealt with.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I am suspicious of others and expect the worst.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I have trouble holding my tongue, I must speak out.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I cannot let go of the past, and react poorly to reminders.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I am hiding something very important and dangerous (family secret, stolen treasure).</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I have taken to substance abuse to cope with my situtation.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I am fearful of abandonment and hate to be alone.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Faction Agent",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Insight",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight and one Intelligence, Wisdom, or Charisma skill of your choice, as appropriate to your faction"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "Badge or emblem of your faction, a copy of a seminal faction text (or code-book for a covert faction), a set of common clothes, and a pouch containing 15 gp."
                  ]
               },
               {
                  "name": "Feature: Safe Haven",
                  "text": [
                     "As a faction agent, you have access to a secret network of supporters and operatives who can provide assistance on your adventures. You know a set of secret signs and passwords you can use to identify such operatives, who can provide you with access to a hidden safe house, free room and board, or assistance in finding information. These agents never risk their lives for you or risk revealing their true identities.",
                     null,
                     "Source: Sword Coast Adventurer's Guide, page 147"
                  ]
               }
            ]
         },
		 {
            "name": "Farmer",
            "source": "PMS Squad",
            "proficiency": "",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Animal Handling, Nature",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Vehicles (Land), Either Carpenter’s Tools or Weaver’s Tools",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A pitchfork or shovel, a set of common clothes, an iron pot, a winter blanket, a small pouch containing 5 gp, and one of the following: three chickens, a goat, or three pounds of flour.",
                  ]
               },
			   {
                  "name": "Farmer Type",
                  "text": [
                     "Farmers of all types are scattered accross the land. You can select the type of farm you grew up on from the Farm Type table or roll randomly. If you wish to come from a more exotic type of farm, work with your GM to determine your origin.",
					 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:200px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Farmer Type</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>Grain Farmer</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Orchard Farmer</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Rice Farmer</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Vegetable Farmer</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>Vineyard Grower</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>Horse Breeder</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>Cattle Rancher</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>Shepherd</td>",
						"</tr>",
						"<tr>",
							"<td>9</td>",
							"<td>Poultry Farmer</td>",
						"</tr>",
						"<tr>",
							"<td>10</td>",
							"<td>Fisherman</td>",
						"</tr>",
					"</table>",
                  ]
               },
               {
                  "name": "Feature: <i>Farmer's Almanac</i>",
                  "text": [
                     "Thanks to a lifetime growing food in every imaginable condition, you are able to provide simple information and goods for your companions. You can accurately predict the weather in your area for the next week. You know what food is really worth, and you can often haggle a better price for produce.",
					 "Additionally, when looking for shelter in farmlands, the common folk are always willing to offer aid. Your hosts will provide shelter and a modest lifestyle, so long as you offer aid around the property. The hosts will not shelter you from the law if it would bring harm to themselves.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Farmers are humble folk, but strong folk. With simple values, they look at life through an optimistic lens. They have a strong work ethic and emphasize communal ties.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Trait</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>The wisdom of my ancestors gives me a unique outlook on life.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>As a child, I played hero. Now I’m of age, I’m determined to become one.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Nothing is more important than a job well done.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I’ve never backed down from a barnyard brawl.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I may not be the best thinker, but there’s a simple solution to everything.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I celebrate the little things in life because I don’t know when hard times will hit.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>Honesty is my greatest virtue, but sometimes I’m too blunt in my delivery.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I’m hard to bore. There’s always something I can do to improve myself.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideal</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Diligence</b>. Don’t put off for tomorrow work that can be done today. Laziness is a vice. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Preparation</b>. Like the seasons, life changes frequently. Prepare for change and you’ll come out on top. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Generous Pride</b>. Watching another enjoy the fruits of your labor is one of life’s luxuries. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Freedom</b>. The landlord can’t see everything that goes down in the stables. Enjoy life’s little opportunities to let loose and have fun. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Pecking Order</b>. Every animal has a social hierarchy. I’m the strongest, so what I say goes. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Fairness</b>. Everyone helps around the farm from a young age, favorite child or not. The family is strong when everyone does their part. (Lawful)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bond</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I set out to earn riches for my family so they don’t have to live harvest to harvest.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I’ve worked the land, I love the land, and I will protect the land at all cost.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Bandits rape and pillage my hometown. I will destroy those bandits some day.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>My landlord is kind to his people. I will pay back that kindness and make him proud to be my liege.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I was born a slave but earned my freedom. I will become rich enough to free my family.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I am in love with a friend. I will do anything to protect their perfect smile.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaw</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I distrust and dislike meeting new people. Most people weren’t raised right.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I only know country-manners, and don’t know proper behavior in civilized settings. I ain’t no city boy.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I was born and raised a slave. I find it hard to stand up to authority figures.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I’m a gullible and naive countryboy. It’s easy for people to con me.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m a bit too fond of alcohol, and I don’t hold my liquor well.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I got a girl pregnant, and ran from the crossbow-wedding. I often regret that decision, and worry about my unknown child.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Far Traveler",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Insight, Perception",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Perception"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Any one musical instrument or gaming set of your choice, likely something native to your homeland"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any one of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "One set of traveler's clothes, any one musical instrument or gaming set you are proficient with, poorly wrought maps from your homeland that depict where you are in Faerûn, a small piece of jewelry worth 10 gp in the style of your homeland's craftsmanship, and a pouch containing 5 gp."
                  ]
               },
               {
                  "name": "Feature: All Eyes on You",
                  "text": [
                     "Your accent, mannerisms, figures of speech, and perhaps even your appearance all mark you as foreign. Curious glances are directed your way wherever you go, which can be a nuisance, but you also gain the friendly interest of scholars and others intrigued by far-off lands, to say nothing of everyday folk who are eager to hear stories of your homeland.",
                     "You can parley this attention into access to people and places you might not otherwise have, for you and your traveling companions. Noble lords, scholars, and merchant princes, to name a few, might be interested in hearing about your distant homeland and people."
                  ]
               }
            ]
         },
         {
            "name": "Folk Hero",
            "source": "Player's Handbook",
            "proficiency": "Animal Handling, Survival",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Animal Handling, Survival"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of artisan's tools, vehicles (land)"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of artisan's tools (one of your choice), a shovel, an iron pot, a set of common clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: Rustic Hospitality",
                  "text": [
                     "Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
                  ]
               }
            ]
         },
         {
            "name": "Guild Artisan",
            "source": "Player's Handbook",
            "proficiency": "Insight, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Persuasion"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of artisan's tools"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of artisan's tools (one of your choice), a letter of introduction from your guild, a set of traveler's clothes, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: Guild Membership",
                  "text": [
                     "As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.",
                     null,
                     "Guilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild's coffers.",
                     null,
                     "You must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild's good graces."
                  ]
               }
            ]
         },
		 {
            "name": "Heretic",
            "source": "Xanathar's Lost Notes to Everything Else",
            "proficiency": "Deception, Religion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Deception, Religion",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A holy symbol (subtly modified to represent your own heretical belief), a prayer book or prayer wheel, vestments, a bottle of invisible ink, a quill, a set of common clothes, and a pouch containing 10 gp.",
                  ]
               },
			   {
                  "name": "Heretical Belief",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Belief</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Dark Moon</b>. A doctrine that ascribes Selûne and Shar as two aspects of the same deity.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Fatemakers</b>. Tymorans who believe mortals can influence and control luck.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Threefold God</b>. A belief that Tyr, Helm and Torm are all the same god.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Forsaken One</b>. A conspiracy that Savras and Leira conceived and abandoned a god child.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Three-Faced Sun</b>. The sun is a tripartite deity, with divine aspects of dawn, noon and dusk.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Shared Suffering</b>. Flagellant Ilmatari who say all mortals must share their god’s suffering.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td><b>Entropy</b>. Belief that dying gods sent a divine sphere of annihilation to Toril to kill wizards.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td><b>Harlot’s Coin</b>. Belief that Waukeen sold her divinity to Graz’zt and he receives her prayers.</td>",
						"</tr>",
					"</table>",
                  ]
               },
               {
                  "name": "Feature: <i>Heretical Contacts</i>",
                  "text": [
                     "You know where to find heretics in settlements where your faith is represented. If no heretics are present, you can indoctrinate weak-willed souls if you spend a day preaching. Where heretics are present, you can always find a place to hide, rest and recuperate. If needed, they can help you escape the settlement on a cart or through a secret tunnel.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "Heretics survive by living on the run, or by blending into the ranks of greater faiths. They tend to be suspicious folk with zealous ideals and unshakable convictions. This sometimes manifests as a sense of superiority over the “unenlightened”.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Traits</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I think I’m right even when I’m wrong.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I pity those who deny the heresy.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I always scope out the closest exits and position myself near them.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>Those who refute my beliefs are damned and aren't worth saving.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m sure my god has chosen me for a greater destiny</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I’m a natural orator, but once I start talking it’s difficult for me to stop. </td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I’m always looking over my shoulder and the slightest things startle me. </td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I believe the end of the world is nigh. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideals</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Guidance</b>. I must teach others my forbidden doctrine. (Neutral) </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Caution</b>. It’s always better to be safe than sorry. (Any)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Knowledge</b>. If this conspiracy is true, what else are we being lied to about? (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Insurrection</b>. My old faith is corrupt and must be brought down by the new order. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Honesty</b>. I’ve been lied to enough, so now I’m sworn to always tell the truth. (Lawful) </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Self-Knowledge</b>. Those who seek the truth become wise beyond their years. (Good) </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bonds</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>The heretics who educated me were burned at the stake. I won’t let that happen to me.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Belief in my old faith still nags at me. Have I chosen the right path? </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I used to be friends with the cleric who’s now hunting me. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I carry a heretical treatise on my person. It mustn’t be found! </td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I protect the faithless so they can know enlightenment.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>One of my underworld contacts reports my movements to the superiors of my old temple.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaws</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I’m suspicious of strangers, as they may be bounty hunters sent to arrest me.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I sneer at those whom I deem unworthy of my time.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I’m deeply superstitious, and have many rituals to avoid bad luck.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I tend to misjudge the devotion of others.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I’m obsessed with my studies, often to the detriment of other concerns.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I’m deeply mistrustful of temple hierarchies.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Hermit",
            "source": "Player's Handbook",
            "proficiency": "Medicine, Religion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Medicine, Religion"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Herbalism Kit"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A scroll case stuffed full of notes from your studies or prayers, a winter blanket, a set of common clothes, an herbalism kit, and 5 gp"
                  ]
               },
               {
                  "name": "Feature: Discovery",
                  "text": [
                     "The quiet seclusion of your extended hermitage gave you access to a unique and powerful discovery. The exact nature of this revelation depends on the nature of your seclusion. It might be a great truth about the cosmos, the deities, the powerful beings of the outer planes, or the forces of nature. It could be a site that no one else has ever seen. You might have uncovered a fact that has long been forgotten, or unearthed some relic of the past that could rewrite history. It might be information that would be damaging to the people who or consigned you to exile, and hence the reason for your return to society.",
                     null,
                     "Work with your DM to determine the details of your discovery and its impact on the campaign."
                  ]
               }
            ]
         },
         {
            "name": "Inheritor",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Survival",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Survival, plus one from among Arcana, History, and Religion"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any one of your choice"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Your choice of a gaming set or a musical instrument"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "Your inheritance, a set of traveler's clothes, any items with which you are proficient, and a pouch containing 15 gp."
                  ]
               },
               {
                  "name": "Feature: Inheritance",
                  "text": [
                     "Choose or randomly determine your inheritance from the possibilities in the table below. Work with your Dungeon Master to come up with details: Why is your inheritance so important, and what is its full story? You might prefer for the DM to invent these details as part of the game, allowing you to learn more about your inheritance as your character does.",
                     "The Dungeon Master is free to use your inheritance as a story hook, sending you on quests to learn more about its history or true nature, or confronting you with foes who want to claim it for themselves or prevent you from learning what you seek. The DM also determines the properties of your inheritance and how they figure into the item's history and importance. For instance, the object might be a minor magic item, or one that begins with a modest ability and increases in potency with the passage of time. Or, the true nature of your inheritance might not be apparent at first and is revealed only when certain conditions are met.",
                     "When you begin your adventuring career, you can decide whether to tell your companions about your inheritance right away. Rather than attracting attention to yourself, you might want to keep your inheritance a secret until you learn more about what it means to you and what it can do for you.",
                     null,
                     "d8 - Object or item:",
                     "1 - A document such as a map, a letter, or a journal",
                     "2-3 - a trinket (see \"Trinkets\" in chapter 5 of the Player's Handbook)",
                     "4 - an article of clothing",
                     "5 - a piece of jewelry",
                     "6 - an arcane book or formulary",
                     "7 - a written story, song, poem, or secret",
                     "8 - a tattoo or other body marking"
                  ]
               }
            ]
         },
         {
            "name": "Investigator",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Insight, Investigation",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Investigation"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A uniform in the style of your unit and indicative of your rank, a horn with which to summon help, a set of manacles, and a pouch containing 10 gp."
                  ]
               },
               {
                  "name": "Feature: Watcher's Eye",
                  "text": [
                     "Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you're more likely to be welcome in the former locations rather than the latter."
                  ]
               }
            ]
         },
         {
            "name": "Knight of the Order",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Persuasion, plus one from among Arcana, History, Nature, and Religion, as appropriate for your order"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Your choice of a gaming set or a musical instrument"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any one of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "One set of traveler's clothes, a signet, banner, or seal representing your place or rank in the order, and a pouch containing 10 gp."
                  ]
               },
               {
                  "name": "Feature: Knightly Regard",
                  "text": [
                     "Your receive shelter and succor from members of your knightly order and those who are sympathetic to its aims. If your order is a religious one, you can gain aid from temples and other religious communities of your deity. Knights of civic orders can get help from the community — whether a lone settlement or a great nation — that they serve, and knights of philosophical orders can find help from those they have aided in pursuit of their ideals, and those who share their ideals.",
                     "This help comes in the form of shelter and meals, and healing when appropriate, as well as occasionally risky assistance, such as a band of local citizens rallying to aid a sorely pressed knight, or those who support the order helping to smuggle a knight out of town when he or she is being hunted unjustly."
                  ]
               }
            ]
         },
		 {
            "name": "Legendary Lineage",
            "source": "Xanathar's Lost Notes to Everything Else",
            "proficiency": "Athletics, History",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, History",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Vehicles (Land)",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     " A set of traveler's clothes, a wood figure made in the likeness of an ancestor, a signet ring, a gaming set in which you are proficient, and a belt pouch containing 15 gp",
                  ]
               },
               {
                  "name": "Feature: <i>Good Reputation</i>",
                  "text": [
                     "Since your family name is known, you can reap many benefits by flying the flag of your heritage. People in positions of power and privilege are willing to take a meeting with you and grant you favors. The DM decides the extent and effect of these favors, but they shouldn't involve lavish gifts or great personal risk to the granter.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "You've lived a different life than those less famous than you, and probably don't know yourself as well as you should. Since birth you've been told you are special and destined for greatness, which is an idea you may be eager to prove or disprove. You're used to being under pressure and to folks talking about you both to your face and behind your back. As you start your adventuring career you have a choice to make. Most people of a heroic lineage who adventure either embrace the family name or try to get out there and make their own way. The result, however, is the same – a determined hero trying to show the world they're something more just a lucky kid with the right parents.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Traits</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I am polite and humble to all who fawn over me. </td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I'm sure you've heard of the great heroes of my family, but let me tell you anyway.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I am quiet in public and don't enjoy being noticed.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I boast about how I will put my ancestors’ deeds to shame.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I am attracted to people who don't fawn over me right away</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I often find reasons to excuse myself from large groups of people who love me for my name.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I am able to fake smile for anyone, even if I hate that person.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I always ask for people to give me free stuff because I can.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideals</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Family</b>. I intend to uphold my family name. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Superiority</b>. I was born better than everyone and so I deserve better than everyone. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Individuality</b>. I am not my family's name and will make my own legend. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Leadership</b>. I feel a call beyond my heritage to protect the people who look to me. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Aspiration</b>. I want to make the people who believe in me proud. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Generosity</b>. I was lucky to be born into this family and I will give back to those less fortunate. (Good)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bonds</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I wield the same weapon my ancestor used.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>No one knows the real me like my childhood best friend. </td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>A parent won't respect me until I make good on the family name.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I would do anything to protect the town where I grew up.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I have my eye on a quiet cottage to which I plan to retire.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I feel like the only person who really gets me is my dog. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaws</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I can only handle so much fawning before I explode in anger.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>If not praised constantly, I doubt myself.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>If you speak ill of my ancestors, I will punch you in the face.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I prefer to have someone else fix my personal problems.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I put down others to boost my own confidence. </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>If something is fashionable, I will avoid it at all costs.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Mercenary Veteran",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Athletics, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Persuasion"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set, vehicles (land)"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A uniform of your company (traveler's clothes in quality), an insignia of your rank, a gaming set of your choice, and a pouch containing the remainder of your last wages (10 gp)."
                  ]
               },
               {
                  "name": "Feature: Mercenary Life",
                  "text": [
                     "You know the mercenary life as only someone who has experienced it can. You are able to identify mercenary companies by their emblems, and you know a little about any such company, including who has hired them recently. You can find the taverns and festhalls where mercenaries abide in any area, as long as you speak the language. You can find mercenary work between adventures sufficient to maintain a comfortable lifestyle (see \"Practicing a Profession\" under \"Downtime Activities\" in chapter 8 of the Player's Handbook)."
                  ]
               }
            ]
         },
         {
            "name": "Noble",
            "source": "Player's Handbook",
            "proficiency": "History, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Persuasion"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp"
                  ]
               },
               {
                  "name": "Feature: Position of Privilege",
                  "text": [
                     "Thanks to your noble birth, people are inclined to think the best of you. Vou are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."
                  ]
               }
            ]
         },
         {
            "name": "Outlander",
            "source": "Player's Handbook",
            "proficiency": "Athletics, Survival",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Survival"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of musical instrument"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A staff, a hunting trap, a trophy from an animal you killed, a set of traveler's clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: Wanderer",
                  "text": [
                     "You have an excellent memory for maps and geography, and you can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and fresh water for yourself and up to five other people each day, provided that the land offers berries, small game, water, and so forth."
                  ]
               }
            ]
         },
		 {
            "name": "Polymorphed",
            "source": "Xanathar's Lost Notes to Everything Else",
            "proficiency": "Survival, Animal Handling/Deception",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Survival and choose one from Animal Handling or Deception",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     " A bag of caltrops, a realistic ink drawing of your polymorphed form, a set of common clothes, and a belt pouch with 5 gp",
                  ]
               },
               {
                  "name": "Feature: <i>Kindred Spirit</i>",
                  "text": [
                     "Nonhostile creatures of the same type as your polymorphed form are inclined to like you. These creatures might help guide you to a place if they know its location, provide you with shelter, or shield you from danger, provided they aren't put directly into harm’s way.",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "You have spent so much time in the skin of another form that you’re not comfortable with your true body. This discomfort may manifest in a physical form like fidgeting, wearing baggy or eccentric clothing, or the need to change your appearance through tattoos or piercings. You may have more of a subconscious mental tick like targeting the appearance of others to make yourself feel better or nightmares of once again living in your polymorphed form. Your old form was a prison that hid your true self, but it was also a way to keep yourself shielded from harm.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Traits</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I am always fidgeting because I am uncomfortable.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I retained a rude physical behavior of my polymorphed form.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I obsess over my appearance and wear eccentric outfits.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I always judge the way others look.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I am unsure of what to say when people ask about me.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I often speak in my head by accident instead of aloud.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>I find it’s easier to lie than give real personal details.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I must keep touching my body to reassure myself I’m in it.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideals</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Freedom</b>. People should be free to express who they are. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Power</b>. If it gets me what I want, I’ll manipulate anyone. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Security</b>. All people deserve a place where they feel at peace. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Beauty</b>. All people should appreciate who they are. (Neutral)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Authority</b>. If you respect authority, you will be protected. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Dog Eat Dog</b>. To survive you must be the smartest or strongest. (Neutral)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bonds</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I have altered my appearance to look like my polymorphed form.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Some friends I made in my polymorphed form don’t know I’ve been turned back.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>I carry a piece of my old body.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>The place where I spent most of my time while polymorphed is home to me.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I still haven’t seen my family since before I was polymorphed.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I still enjoy eating what I ate in my polymorphed form. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaws</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I want to be back in my polymorphed form.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I sometimes believe I still possess abilities of my polymorphed form that I no longer have.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>All transmutation magic is terrible and must be stopped. </td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I physically hurt myself for assurance I am in my true form</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>It’s easier to back down from an argument than try to convince someone I'm right.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>The opinions of my friends are more important than my own.</td>",
						"</tr>",
					"</table>",
                   ]
               },
			   {
                  "name": "Variant Feature: <i>Body Horror</i>",
                  "text": [
                     "This feature is meant for games using the variant madness rules in chapter 8 of the <i>Dungeon Master’s Guide</i>. Before choosing this feature you must ask your DM. You have spent so much time in the form of another creature that you aren't easily shocked by bodily manipulation and mutilation. Whenever such a sight would cause you to save against a madness effect you automatically succeed.",
                  ]
               },
            ]
         },
		 {
            "name": "Retired Adventurer",
            "source": "Xanathar's Lost Notes to Everything Else",
            "proficiency": "History, Insight",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Insight",
                  ]
               },
			   {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set",
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice",
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     ": An old map to a secret dungeon you never got around to visiting, a set of common clothes, a set of bone dice or a deck of cards, and a purse containing 25 gp",
                  ]
               },
               {
                  "name": "Feature: <i>C-List Celebrity</i>",
                  "text": [
                     "Whenever you are in a civilized area that knows of you past adventures, you can live a aristocratic life style for free as people wish to honor your past deeds. You can also use your influence to gain audiences with important political figures and get random gifts from admiring fans. However if you choose to use your influence in this way, it also alerts anyone in the area looking for you of your location and draws attention to your party",
                  ]
               },
               {
                  "name": "Suggested Characteristics",
                  "text": [
                     "As a voice of experience in your party, you know the danger of the road you walk. You understand when to be cautious and when it is time to take a risk. You have the right advice, warnings, and stories for all situations. Even if you don't know what you're doing, your past makes others look to you for leadership.",
                   ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d8</th>",
							"<th id='myheader'>Personality Traits</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I have no idea how to tell a short story.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>I'm sure of my first instincts and always act on them.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Anyone younger than I am needs my advice.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I don't enjoy physical contact with others unless it is my fist in their faces.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I show my numerous scars to help drive points home.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>When I laugh, the volume of my voice fills up the entire room.</td>",
						"</tr>",
						"<tr>",
							"<td>7</td>",
							"<td>Nothing pleases me more than a good meal, good company, and job well done.</td>",
						"</tr>",
						"<tr>",
							"<td>8</td>",
							"<td>I often correct others when their lack of manners offends me. </td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Ideals</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td><b>Generosity</b>. Everything I have I share with those around me and in need. (Good)</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td><b>Good Times</b>. I take advantage of every opportunity to have fun. (Chaotic)</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td><b>Power</b>. Those who don't tremble at my name will have reason enough to do so soon. (Evil)</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td><b>Logic</b>. Emotions shouldn't make decisions for us. (Lawful)</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td><b>Greater Good</b>. I would gladly give my life to defend those who can't defend themselves. (Good) </td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td><b>Live and Let Live</b>. Just because we disagree doesn't mean we have to kill each other. (Neutral)</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Bonds</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I never found that magic item I wanted in my early career.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>There's more than a few broken hearts in my past.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>There is an inn I frequent where no one knows about my past life and I'd like to keep it that way.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I can't go back to the town I accidentally partially leveled.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>My old adventuring companions get together now and then to relive the good old days.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>A famous song is actually about one of my greatest battles.</td>",
						"</tr>",
					"</table>",
                   ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
					 "</style>",
					"<table id='mytable' style='width:300px;border:1px solid black'>",
						"<tr>",
							"<th id='myheader'>d6</th>",
							"<th id='myheader'>Flaws</th>",
						"</tr>",
						"<tr>",
							"<td>1</td>",
							"<td>I don't take the advice of others because I know best always.</td>",
						"</tr>",
						"<tr>",
							"<td>2</td>",
							"<td>Violence solves most problems.</td>",
						"</tr>",
						"<tr>",
							"<td>3</td>",
							"<td>Ale is my very, very best friend.</td>",
						"</tr>",
						"<tr>",
							"<td>4</td>",
							"<td>I really don't know when to shut up.</td>",
						"</tr>",
						"<tr>",
							"<td>5</td>",
							"<td>I tend to fall asleep at times when I should be alert.</td>",
						"</tr>",
						"<tr>",
							"<td>6</td>",
							"<td>I am sarcastic at all times, especially when least appropriate.</td>",
						"</tr>",
					"</table>",
                   ]
               }
            ]
         },
         {
            "name": "Sage",
            "source": "Player's Handbook",
            "proficiency": "Arcana, History",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Arcana, History"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Two of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A bottle of black ink, a quill, a small knife, a letter from a dead colleague posing a question you have not yet been able to answer, a set of common clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: Researcher",
                  "text": [
                     "When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information comes from a library, scriptorium, university, or a sage or other learned person or creature, Your DM might rule that the knowledge you seek is secreted away in an almost inaccessible place, or that it simply cannot be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
                  ]
               }
            ]
         },
         {
            "name": "Sailor",
            "source": "Player's Handbook",
            "proficiency": "Athletics, Perception",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Perception"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Navigator's tools, vehicles(water)"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A belaying pin (dub), 50 feet of silk rope, a lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table in chapter 5), a set of common clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: Ship's Passage",
                  "text": [
                     "When you need to, you can secure free passage on a sailing ship for yourself and your adventuring companions. You might sail on the ship you served on, or another ship you have good relations with (perhaps one captained by a former crewmate). Because you're calling in a favor, you can't be certain of a schedule or route that will meet your every need. Your Dungeon Master will determine how long it takes to get where you need to go. In return for your free passage, you and your companions are expected to assist the crew during the voyage."
                  ]
               }
            ]
         },
         {
            "name": "Soldier",
            "source": "Player's Handbook",
            "proficiency": "Athletics, Intimidation",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Intimidation"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set, vehicles (land)"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "An insignia of rank, a trophy taken from a fallen enemy (a dagger, broken blade, or piece of a banner), a set of bone dice or deck of cards, a set of common clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: Military Rank",
                  "text": [
                     "You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."
                  ]
               }
            ]
         },
         {
            "name": "Urban Bounty Hunter",
            "source": "Sword Coast Adventurer's Guide",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Choose two from among Deception, Insight, Persuasion, and Stealth"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Choose two from among one type of gaming set, one musical instrument, and thieves's tools"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of clothes appropriate to your duties and a pouch containing 20 gp"
                  ]
               },
               {
                  "name": "Feature: Ear to the Ground",
                  "text": [
                     "You are in frequent contact with people in the segment of society that your chosen quarries move through. These people might be associated with the criminal underworld, the rough-and-tumble folk of the streets, or members of high society. This connection comes in the form of a contact in any city you visit, a person who provides information about the people and places of the local area."
                  ]
               }
            ]
         },
         {
            "name": "Urchin",
            "source": "Player's Handbook",
            "proficiency": "Sleight of Hand, Stealth",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Sleight of Hand, Stealth"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Disguise Kit, thieves' tools"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A small knife, a map of the city you grew up in, a pet mouse, a token to remember your parents by, a set of common clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: City Secrets",
                  "text": [
                     "You know the secret patterns and flow to cities and can find passages through the urban sprawl that others would miss. When you are not in combat, you (and companions you lead) can travel between any two locations in the city twice as fast as your speed would normally allow."
                  ]
               }
            ]
         },
         {
            "name": "Uthgardt Tribe Member",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "Athletics, Survival",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Survival"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any one of your choice"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of musical instrument or artisan's tools"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A hunting trap, a totemic token or set of tattoos marking your loyalty to Uthgar and your tribal totem, a set of traveler's clothes, and a pouch containing 10 gp."
                  ]
               },
               {
                  "name": "Feature: Uthgardt Heritage",
                  "text": [
                     "You have an excellent knowledge of not only your tribe's territory, but also the terrain and natural resources of the rest of the North. You are familiar enough with any wilderness area that you can find twice as much food and water as you normally would when you forage there.",
                     "Additionally, you can call upon the hospitality of your people, and those allied with  your tribe, often including members of the druid circles, tribes of nomadic elves, the Harpers, and the priesthoods devoted to the gods of the First Circle."
                  ]
               }
            ]
         },
         {
            "name": "Waterdhavian Noble",
            "source": "Sword Coast Adventurer's Guide",
            "proficiency": "History, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Persuasion"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Any one of your choice"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set or one musical instrument"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A set of fine clothes, a signet ring or brooch, a scroll of pedigree, a skin of fine zzar or wine, and a purse containing 20 gp."
                  ]
               },
               {
                  "name": "Feature: Kept in Style",
                  "text": [
                     "While you are in Waterdeep or elsewhere in the North, your house sees to your everyday needs. Your name and signet are sufficient to cover most of your expenses; the inns, taverns, and festhalls you frequent are glad to record your debt and send an accounting to your family's estate in Waterdeep to settle what you owe.",
                     "This advantage enables you to live a comfortable lifestyle without having to pay 2 gp a day for it, or reduces the cost of a wealthy or aristocratic lifestyle by that amount. You may not maintain a less affluent lifestyle and use the difference as income — the benefit is a line of credit, not an actual monetary reward."
                  ]
               }
            ]
         },
         {
            "name": "Variant Criminal (Spy)",
            "source": "Player's Handbook",
            "proficiency": "Deception, Stealth",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Deception, Stealth"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set, thief's tools"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: Spy Contact",
                  "text": [
                     "You have a reliable and trustworthy contact who acts as your liaison to a network of other spies. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
                  ]
               }
            ]
         },
         {
            "name": "Variant Entertainer (Gladiator)",
            "source": "Player's Handbook",
            "proficiency": "Acrobatics, Performance",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Acrobatics, Performance"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Disguise kit, one type of musical instrument"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "An inexpensive but unusual weapon, such as a trident or net (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), a costume, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: By Popular Demand",
                  "text": [
                     "You can find a place to perform in any place that features combat for entertainment-perhaps a gladiatorial arena or secret pit fighting club. In such an area, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you."
                  ]
               }
            ]
         },
         {
            "name": "Variant Guild Artisan (Guild Merchant)",
            "source": "Player's Handbook",
            "proficiency": "Insight, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Insight, Persuasion"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Navigator's Tools or an additional language"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A mule and cart, a letter of introduction from your guild, a set of traveler's clothes, and a belt pouch containing 15 gp"
                  ]
               },
               {
                  "name": "Feature: Guild Membership",
                  "text": [
                     "As an established and respected member of a guild or large merchant consortium, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.",
                     null,
                     "Guilds or consortiums often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild's coffers.",
                     null,
                     "You must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild's good graces."
                  ]
               }
            ]
         },
         {
            "name": "Variant Noble (Knight)",
            "source": "Player's Handbook",
            "proficiency": "History, Persuasion",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "History, Persuasion"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "One type of gaming set"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "One of your choice"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A banner or other token from a noble lord or lady to whom you have given your heart, a set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp"
                  ]
               },
               {
                  "name": "Feature: Retainers",
                  "text": [
                     "You have the service of three retainers loyal to your family. These retainers can be attendants or messengers, and one might be a majordomo. One of your retainers is a noble who serves as your squire, aiding you in exchange for training on his or her own path to knighthood. Your two remaining retainers might include a groom to care for your horse and a servant who polishes your armor (and even helps you put it on).",
                     null,
                     "Your retainers (2 commoners, 1 noble) can perform mundane tasks for you, but they do not fight for you, will not follow you into obviously dangerous areas (such as dungeons), and will leave if they are frequently endangered or abused."
                  ]
               }
            ]
         },
         {
            "name": "Variant Sailor (Pirate)",
            "source": "Player's Handbook",
            "proficiency": "Athletics, Perception",
            "trait": [
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Athletics, Perception"
                  ]
               },
               {
                  "name": "Tool Proficiencies",
                  "text": [
                     "Navigator's tools, vehicles(water)"
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "A belaying pin (dub), 50 feet of silk rope, a lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table in chapter 5), a set of common clothes, and a belt pouch containing 10 gp"
                  ]
               },
               {
                  "name": "Feature: Bad Reputation",
                  "text": [
                     "No matter where you go, people are afraid of you due to your reputation. When you are in a civilized settlement, you can get away with minor criminal offenses, such as refusing to pay for food at a tavern or breaking down doors at a local shop, since most people will not report your activity to the authorities."
                  ]
               }
            ]
         },
         {
            "name": "Haunted One",
            "source": "Curse of Strahd",
            "proficiency": "",
            "trait": [
               {
                  "name": "Feature: Harrowing Event",
                  "text": [
                     "Prior to becoming an adventurer, your path in life was defined by one dark moment, one fateful decision, or one tragedy. Now you feel a darkness threatening to consume you, and you fear there may be no hope of escape. Choose a harrowing event that haunts you, or roll 1d10.",
                     null,
                     "1. A monster that slaughtered dozens of innocent people spared your life, and you don't know why.",
                     null,
                     "2. You were born under a dark star. You can feel it watching you, coldly and distantly. Sometimes it beckons you in the dead of night.",
                     null,
                     "3. An apparition that has haunted your family for generations now haunts you. You don't know what it wants, and it won't leave you alone.",
                     null,
                     "4. Your family has a history of practicing the dark arts. You dabbled once and felt something horrible clutch at your soul, whereupon you  ed in terror.",
                     null,
                     "5. An oni took your sibling one cold, dark night, and you were unable to stop it.",
                     null,
                     "6. You were cursed with lycanthropy and later cured. You are now haunted by the innocents you slaughtered.",
                     null,
                     "7. A hag kidnapped and raised you. You escaped, but the hag still has a magical hold over you and fills your mind with evil thoughts.",
                     null,
                     "8. You opened an eldritch tome and saw things un t for a sane mind. You burned the book, but its words and images are burned into your psyche.",
                     null,
                     "9. A fiend possessed you as a child. You were locked away but escaped. The fiend is still inside you, but now you try to keep it locked away.",
                     null,
                     "10. You did terrible things to avenge the murder of someone you loved. You became a monster, and it haunts your waking dreams."
                  ]
               },
               {
                  "name": "Personality Trait",
                  "text": [
                     "Choose or randomly determine",
                     null,
                     "1. I don't run from evil. Evil runs from me.",
                     null,
                     "2. I like to read and memorize poetry. It keeps me calm and brings me fleeting moments of happiness.",
                     null,
                     "3. I spend money freely and live life to the fullest, knowing that tomorrow I might die.",
                     null,
                     "4. I live for the thrill of the hunt.",
                     null,
                     "5. I don't talk about the thing that torments me. I'd rather not burden others with my curse.",
                     null,
                     "6. I expect danger around every corner.",
                     null,
                     "7. I refuse to become a victim, and I will not allow others to be victimized.",
                     null,
                     "8. I put no trust in divine beings."
                  ]
               },
               {
                  "name": "Ideal",
                  "text": [
                     "Choose or randomly determine",
                     null,
                     "1. I try to help those in need, no matter what the personal cost. (Good)",
                     null,
                     "2. I'll stop the spirits that haunt me or die trying. (Any)",
                     null,
                     "3. I kill monsters to make the world a safer place, and to exorcise my own demons. (Good)",
                     null,
                     "4. I have a dark calling that puts me above the law. (Chaotic)",
                     null,
                     "5. I like to know my enemy's capabilities and weaknesses before rushing into battle. (Lawful)",
                     null,
                     "6. I'm a monster that destroys other monsters, and anything else that gets in my way. (Evil)"
                  ]
               },
               {
                  "name": "Bond",
                  "text": [
                     "Choose or randomly determine",
                     null,
                     "1. I keep my thoughts and discoveries in a journal. My journal is my legacy.",
                     null,
                     "2. I would sacrifice my life and my soul to protect the innocent.",
                     null,
                     "3. My torment drove away the person I love. I strive to win back the love I've lost.",
                     null,
                     "4. A terrible guilt consumes me. I hope that I can find redemption through my actions.",
                     null,
                     "5. There's evil in me, I can feel it. It must never be set free.",
                     null,
                     "6. I have a child to protect. I must make the world a safer place for him (or her)."
                  ]
               },
               {
                  "name": "Flaw",
                  "text": [
                     "Choose or randomly determine",
                     null,
                     "1. I have certain rituals that I must follow every day. I can never break them.",
                     null,
                     "2. I assume the worst in people.",
                     null,
                     "3. I feel no compassion for the dead. They're the lucky ones.",
                     null,
                     "4. I have an addiction.",
                     null,
                     "5. I am a purveyor of doom and gloom who lives in a world without hope.",
                     null,
                     "6. I talk to spirits that no one else can see."
                  ]
               },
               {
                  "name": "Skill Proficiencies",
                  "text": [
                     "Chose two of Arcana, Investigation, Religion, or Survival"
                  ]
               },
               {
                  "name": "Languages",
                  "text": [
                     "Choose one exotic language (Abyssal, Celestial, Deep Speech, Draconic, Infernal, Primordial, Sylvan, or Undercommon)"
                  ]
               },
               {
                  "name": "Feature: Heart of Darkness",
                  "text": [
                     "Those who look into your eyes can see that you have faced unimaginable horror and that you are no stranger to darkness. Though they might fear you, commoners will extend you every courtesy and do their utmost to help you. Unless you have shown yourself to be a danger to them, they will even take up arms to fight alongside you, should you find yourself facing an enemy alone."
                  ]
               },
               {
                  "name": "Equipment",
                  "text": [
                     "Monster hunter's pack, one trinket of special significance (choose one or roll on the Gothic Trinkets table)"
                  ]
               }
            ]
         }
      ],
      "_version": "5"
   }
}
