var templatedata = {
   "compendium": {
      "template": [
	     {
            "//": "---------------------------------------------------------",
			"//": "----------------Vampire Template Start-------------------",
			"//": "---------------------------------------------------------",
			"//": "",
			"name": "Vampire (RHB)",
            "flavor": [
				"&nbsp;&nbsp;&nbsp; Vampires are pale, humanoid beings who are neither dead nor alive. They are Undead, feeding from the life force of living things. They have dark, even reddish eyes and long, sharp fangs that can be retracted at will. They are known for their strength, speed, and charm, which can be a very deadly combination. Apart from their gained undead appearance, they look very similar to whatever they looked like in life. <br><br> &nbsp;&nbsp;&nbsp; Like liches, they often embrace finery and decadence and may assume the guise of nobility. Despite their human appearance, vampires can be easily recognized, for they cast no shadows and throw no reflections in mirrors."
			],
            "autolevel": [
               {
                  "feature": [
                     {
                        "name": "Creating a Vampire",
                        "text": [
                           "'Vampire' is an acquired template that can be added to any humanoid or monstrous humanoid creature (referred to hereafter as the base creature).",
						   "<b><i>Class Features: </i></b> A vampire uses all the base creatures statistics and special abilities except as noted. Vampires speak any languages they knew in life.",
						   "<b><i>Alignment:</i></b> Vampires are always of evil alignment (any).",
						   "<b><i>Size and Type: </i></b> The creature's type changes to undead. Do not recalculate attack bonuses, saves, or skills. The creature's size remains unchanged.",
						   "<b><i>Hit Dice: </i></b> Humanoids - based on class. Monsters - based on size.",
						   "<b><i>Speed: </i></b> Same as the base creature. If the base creature has a swim speed, the vampire retains the ability to swim and is not vulnerable to immersion in running water.",
						   "<b><i>AC Bonus: </i></b> Per variation (Spawn, Full, Lord)",
						   "<b><i>Ability Point Bonus: </i></b> Per variation (Spawn, Full, Lord)",
						   "<b><i>Skills: </i></b> Per variation (Spawn, Full, Lord)",
						   "<b><i>Feats: </i></b> Per variation (Spawn, Full, Lord)",
						   "<b><i>Damage Resistance: </i></b> Vampires are resistant to cold and electric damage, as well as damage taken by non-magical weapons. Silvered weapons will damage them, though the level of silvering affects each variation of Vampire differently. <br>&nbsp;&nbsp;&nbsp; • <i>Silvered (Plated)</i> - You can silver a single weapon or ten pieces of ammunition for 100 gp. <br>&nbsp;&nbsp;&nbsp; • <i>Silvered (Enchanted)</i> - A silvered (plated) weapon that is enchanted to a level of  +1 or better. <br>&nbsp;&nbsp;&nbsp; • <i>Silvered (Blessed)</i> - A silvered (plated) weapon blessed by a Cleric of a good-aligned deity by way of the <i>Ceremony</i> Spell.",
						   "<b><i>Damage Immunities:</i></b> Vampires (all variations) are immune to necrotic damage.",
						   "<b><i>Attack:</i></b> A vampire retains all the attacks of the base creature and also gains a claw attack if it didn’t already have one. If the base creature can use weapons, the vampire retains this ability. A creature with natural weapons retains those natural weapons. A vampire fighting without weapons uses its claw attack or other natural weapons (if it has any). A vampire armed with a weapon uses its claws, other natural weapons, or weapon, whichever it desires.",
						   "<b><i>Claw Attack:</i></b> A vampire fighting without weapons uses either its claws (which it makes 2 attacks with) or its natural weapons (if it has any). If armed with a weapon, it usually uses the weapon as its primary attack along with its claws or other natural weapon as a secondary attack.  For the claw attack, use the appropriate damage value from the table below according to the vampire’s size, adding any additional modifiers. Creatures that have other kinds of natural weapons retain their old damage values or use the appropriate value from the table below, whichever is better. <br>&nbsp;&nbsp;&nbsp; • When a vampire successfully hits a creature with a claw attack, it can also make an attempt to grapple its target (DC per variant).",
						   "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
							"</style>",
							"<table id='mytable'>",
								"<tr>",
									"<th class='border' colspan='8'></th>",
								"</tr",
								"<tr>",
									"<th id='myheader' colspan='4' style='font-size:15px'>Claw Attack Damage Table</th>",
									"<th id='myheader' colspan='5'></th>",
								"</tr>",
								"<tr>",
									"<th id='myheader' colspan='4'></th>",
									"<th id='myheader' colspan='4'></th>",
								"</tr>",
								"<tr>",
									"<th id='myheader'><b>Size</b></th>",
									"<th id='myheader'><b>Damage</b></th>",
								"</tr>",
								"<tr>",
									"<td>Fine</td>",
									"<td>1</td>",
								"</tr>",
								"<tr>",
									"<td>Diminutive</td>",
									"<td>1d2</td>",
								"</tr>",
								"<tr>",
									"<td>Tiny</td>",
									"<td>1d3</td>",
								"</tr>",
								"<tr>",
									"<td>Small</td>",
									"<td>1d4</td>",
								"</tr>",
								"<tr>",
									"<td>Medium</td>",
									"<td>1d6</td>",
								"</tr>",
								"<tr>",
									"<td>Large</td>",
									"<td>2d6</td>",
								"</tr>",
								"<tr>",
									"<td>Huge</td>",
									"<td>3d6</td>",
								"</tr>",
								"<tr>",
									"<td>Gargantuan</td>",
									"<td>4d6</td>",
								"</tr>",
								"<tr>",
									"<td>Colossal</td>",
									"<td>5d6</td>",
								"</tr>",
								"<tr>",
									"<th class='border' colspan='8'></th>",
								"</tr>",
							"</table>",
							"<b><i>Bite/Drain Attack:</i></b> Vampires feed off the blood life force of living creatures, draining blood with a bite attack that renders their victims helpless. A vampire is able to bite a willing creature, a creature that is incapacitated, or a creature that has been grappled by the vampire.",
							"&nbsp;&nbsp;&nbsp; • The bite attack does necrotic and piercing damage (amount per variant, size table below shows the main base damage) which reduces the target's hit point maximum by the amount of necrotic damage taken - the vampire gains an equal amount of temporary hit points as the amount of necrotic damage dealt by this attack. <br>&nbsp;&nbsp;&nbsp; • The bitten creature remains grappled, and can re-roll their check to break the grapple each round on their turn - if they fail, the vampire can continue to drain them by dealing piercing and necrotic damage each round, further reducing the creature's hit points. <br>&nbsp;&nbsp;&nbsp; • The reduction in the bitten creatures' hit points lasts until the creature finishes a long rest - a creature whose hit points are reduced to 0 in this manner dies. <br>&nbsp;&nbsp;&nbsp; • A creature slain in this manner and then fed the blood of the slaying vampire rises the following night as a vampire spawn under the vampire's control (not applicable for spawn variation).",
							 "<style>table#mytable tr:nth-child(odd){background-color:#dddddd;} table#mytable th{text-align:center;} th#myheader{background-color:#fdf1dc;} table#mytable tr{text-align:center;}",
							"</style>",
							"<table id='mytable'>",
								"<tr>",
									"<th class='border' colspan='8'></th>",
								"</tr",
								"<tr>",
									"<th id='myheader' colspan='4' style='font-size:15px'>Bite Attack Damage Table</th>",
									"<th id='myheader' colspan='5'></th>",
								"</tr>",
								"<tr>",
									"<th id='myheader' colspan='4'></th>",
									"<th id='myheader' colspan='4'></th>",
								"</tr>",
								"<tr>",
									"<th id='myheader'><b>Size</b></th>",
									"<th id='myheader'><b>Damage</b></th>",
								"</tr>",
								"<tr>",
									"<td>Fine</td>",
									"<td>1d2</td>",
								"</tr>",
								"<tr>",
									"<td>Diminutive</td>",
									"<td>1d3</td>",
								"</tr>",
								"<tr>",
									"<td>Tiny</td>",
									"<td>1d4</td>",
								"</tr>",
								"<tr>",
									"<td>Small</td>",
									"<td>1d6</td>",
								"</tr>",
								"<tr>",
									"<td>Medium</td>",
									"<td>1d8</td>",
								"</tr>",
								"<tr>",
									"<td>Large</td>",
									"<td>2d8</td>",
								"</tr>",
								"<tr>",
									"<td>Huge</td>",
									"<td>3d8</td>",
								"</tr>",
								"<tr>",
									"<td>Gargantuan</td>",
									"<td>4d8</td>",
								"</tr>",
								"<tr>",
									"<td>Colossal</td>",
									"<td>5d8</td>",
								"</tr>",
								"<tr>",
									"<th class='border' colspan='8'></th>",
								"</tr>",
							"</table>",
							"<b><i>Abilities:</i></b> <br>&nbsp;&nbsp;&nbsp; • <i>Spider Climb:</i> A Vampire (all variations) can move up, down, and across vertical surfaces as well as upside down along ceilings, while leaving its hands free. The Vampire also has a climbing speed equal to its walking speed. <br>&nbsp;&nbsp;&nbsp; • <i>Regeneration:</i> Per variant (Spawn, Full, Lord)",
                        ]
                     },
					 {
                        "name": "Vampire Weaknesses",
                        "text": [
                           "All variations of Vampire have the following weaknesses unless otherwise noted in their variation:",
						   "<b><i>Holy Symbol:</i></b> A vampire cannot tolerate a strongly presented Holy Symbol, and will recoil from it - it is not harmed, simply held at bay. Per variant (Spawn, Full, Lord)",
						   "<b><i>Forbiddance:</i></b> The vampire can't enter a residence without an invitation from one of the occupants. Per Variant (Spawn, Full, Lord)",
						   "<b><i>Harmed by Running Water:</i></b> Per Variant (Spawn, Full, Lord)",
						   "<b><i>Stake to the Heart:</i></b> Per variant (Spawn, Full, Lord).",
						   "<b><i>Sunlight Hypersensitivity:</i></b> Per Variant (Spawn, Full, Lord)",
                        ]
                     },
					 {
                        "name": "Slaying a Vampire",
                        "text": [
                           "When a Vampire or Vampire Lord drops to 0 Hit Points outside its Resting place, it transforms into a cloud of mist instead of falling unconscious, provided that it isn't in sunlight or running water. If it can't transform, it is destroyed.", 
						   "While it has 0 Hit Points in mist form, it can't revert to its vampire form, and it must reach its Resting place within 2 hours or be destroyed. Once in its Resting place, it reverts to its vampire form. It is then Paralyzed until it regains at least 1 hit point.",
						   "After spending 1 hour in its Resting place with 0 Hit Points, it regains 1 hit point.",
                        ]
                     },
					 {
                        "name": "Vampire Characters",
                        "text": [
                           "Vampires are always evil, which causes characters of certain classes to lose some class abilities. A vampire cleric or paladin can only draw power from evil-aligned domains or deities, and lose any abilities or spells from good-aligned ones.",
                        ]
                     },
					 {
						"//": "---------------------------------------------------------",
						"//": "-------------Vampire Sub Templates Start-----------------",
						"//": "---------------------------------------------------------",
						"//": "",
						"//": "----------------Vampire Spawn Start----------------------",
						"//": "",
						"name": "Creating a Vampire: Vampire Spawn",
						"text": [
							"Spawn are created willfully by Vampires or Vampire Lords and are generally under the control of the Vampire who created them, unless they attain a level of power which allows them to break free of their master's will, or their master decides to release them.",
							"Vampire spawn appear as they did in life, though their features are hardened and appeared predatory. They spend their lives in darkness and believe they are better than other living or undead creatures. Even though they do not possess all of the standard vampire powers, they gain more power than they possessed before becoming undead, and possess all the traditional weaknesses and vulnerabilities Vampires hold (often to a greater degree).",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Creating a Vampire",
						"issubclass": "YES",
						"_optional": "YES"
					},
					{
						"name": "Spawn Progression",
						"text": [
							"When a spawn becomes a level that is greater than or equal to half the level of their master, they can make a Wisdom saving throw to break the control over them and become a full vampire. If the spawn fails this save, they cannot try again until the next New Moon (1 month). <br> While a spawn is under their master's control, they are considered fully dominated - they have their own thoughts and alignment, but must do whatever their master asks of them.",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Vampire Spawn",
						"suboption": "YES",
						"_optional": "YES"
					 },
					 {
						"name": "Bonuses",
						"text": [
							"<b><i>AC Bonus</i></b>: +1 <br> <b><i>Ability Point Bonus</i></b>: +2 to STR, DEX, CON, INT, WIS, and CHA",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Vampire Spawn",
						"suboption": "YES",
						"_optional": "YES"
					 },
					 {
						"name": "Skill Proficiencies",
						"text": [
							"<b>Pick 2 from</b>: acrobatics, athletics, deception, intimidation, perception, or stealth <br> You can add your proficiency modifier to the chosen skills - if you are already proficient with the skill, double your proficiency modifier.",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Vampire Spawn",
						"suboption": "YES",
						"_optional": "YES"
					 },
					 {
						"name": "Damage Resistances/Immunities",
						"text": [
							"• Resistance to Cold and Electric damage <br> • Resistance to Slashing, Piercing, and Bludgeoning damage from non-silvered/non-magical weapons <br> • Immunity to Necrotic damage",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Vampire Spawn",
						"suboption": "YES",
						"_optional": "YES"
					 },
					 {
						"name": "Attacks/Abilities",
						"text": [
							"<b><i>Claw attack (Medium Size) (2 Attacks)</i></b>: + STR or DEX Mod to hit, 1d6 + STR or DEX Mod Slashing Damage. After a successful claw attack, the spawn can then make a grapple check.",
							"<b><i>Bite Attack</i></b>: After a successful grapple, the spawn rolls a melee attack with advantage, and on a hit deals 1d8 + STR or DEX Mod Piercing and 1d8 Necrotic damage - the spawn heals a number of hit points equal to the necrotic damage dealt by this bite attack (if they are at full health, they do not benefit from this ability). <br> The max hit points of the target are reduced by a number equal to the necrotic damage taken - hit points reduced in this manner can be healed by potions or healing spells, but otherwise return after a long rest.",
							"<b><i>Regeneration</i></b>: The spawn regains 10 hit points at the beginning of each round, as long as they were not damaged by radiant damage, holy water, or a silvered weapon on the preceding round.",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Vampire Spawn",
						"suboption": "YES",
						"_optional": "YES"
					 },
					 {
						"name": "Weaknesses",
						"text": [
							"<b><i>Holy Symbol</i></b>: A holy symbol strongly presented keeps the spawn at bay - they cannot willingly approach the bearer nearer than a distance of 20 ft. and cannot make melee attacks against them. If a spawn is touched by a holy symbol presented in this manner, on each turn the symbol touches the spawn it takes 1d6 radiant damage.",
							"<b><i>Forbiddance</i></b>: The Spawn can't enter a residence without an invitation from one of the occupants. If a spawn enters a residence without permission (presumably forced), they are destroyed immediately.",
							"<b><i>Harmed by Running Water</i></b>: The spawn is instantly destroyed if it travels through or ends its turn in running water.",
							"<b><i>Stake to the Heart</i></b>: If a piercing weapon made of wood is driven into the spawn's heart, the spawn is destroyed immediately. <br> DC to stake = Spawn Base AC + Spawn Prof Mod (attacks to the heart are rolled with disadvantage)",
							"<b><i>Sunlight Sensitivity</i></b>: A spawn that is exposed to sunlight is destroyed immediately",
						],
						"subclass": "Creating a Vampire: Vampire Spawn",
						"parent": "Vampire Spawn",
						"suboption": "YES",
						"_optional": "YES"
					 },
					{
						"//": "",
						"//": "-----------------------Vampire Start-----------------------",
						"//": "",
						"name": "Creating a Vampire: Vampire",
						"text": [
							"This is a full vampire.",
						],
						"subclass": "Creating a Vampire: Vampire",
						"parent": "Creating a Vampire",
						"issubclass": "YES",
						"_optional": "YES"
					},
					{
					 "//": "",
					 "//": "-------------------Vampire Lord Start-----------------------",
					 "//": "",
					"name": "Creating a Vampire: Vampire Lord",
						"text": [
							"This is a vampire lord.",
						],
						"subclass": "Creating a Vampire: Vampire Lord",
						"parent": "Creating a Vampire",
						"issubclass": "YES",
						"_optional": "YES"
					},
					 
                  ],
                  "_level": "1"
               },
            ],
         },

      ],
   }
}
